
/*В классе App реализуйте публичный статический метод getMostPopulatedCity(),
который находит среди всех городов самый густонаселенный.
Метод принимает в качестве параметра перечень городов Map<String, Integer>,
где ключ - это название города, а значение - его население.
Метод должен вернуть строку, название города с максимальным населением*/
public class App {

    public static void main(String[] args) {

        String text = "Сколько раз в этом предложении встречается слово раз, и слово сколько, и слово слово?!";
        System.out.println(WordCounter.wordsCounter(text));
    }

}
