package OOP;

import lombok.Getter;

/*сборка собственного варианта пиццы при заказе на сайте пиццерии.
Вы можете выбрать различные варианты теста, соуса, начинки.
При этом не все параметры являются обязательными.
Например, вегетарианский вариант не содержит мясную начинку. А кто-то, наоборот, не любит овощи
size — размер пиццы, строка
dough — тип теста, строка
sauce — соус, строка
meatTopping — мясная начинка, строка
vegetableTopping — овощная начинка, строка
cheeseTopping — сорт сыра, строка
Сделаем класс иммутабельным. Реализуйте в классе билдер и геттеры для всех полей*/
@Getter
//@Builder
//@Data
public final class Pizza {

}
