/*Протестируйте метод toHtmlList(), который преобразует различные входные форматы в выходной HTML.
Поддерживаются форматы JSON, YAML

var html1 = toHtmlList("/path/to/yaml/file");
var html2 = toHtmlList("/path/to/json/file");
Каждый из входных файлов для этой функции содержит список элементов,
из которых формируется маркированный список <ul>. Входные данные и выходной HTML можно подсмотреть в фикстурах.

Ваша задача — пропустить через этот метод входные файлы
и сравнить результат работы с ожидаемым значением, находящимся в файле src/test/resorces/fixtures/result.html.
Метод принимает на вход путь к файлу.

Подсказки
В этом упражнении можно использовать параметризованные тесты.
А можно не использовать и написать несколько отдельных тестов для различных форматов
Файлы с данными в формате YAML могут иметь разрешение .yaml или .yml*/



public class MethodsTest {
}
